package com.example.trytolearn
import android.content.Context
import android.content.Intent
import android.content.SharedPreferences
import android.os.Bundle
import android.widget.Button
import android.widget.TextView
import android.widget.Toast
import androidx.appcompat.app.AppCompatActivity
import kotlinx.android.synthetic.main.first_layout.*
import kotlinx.coroutines.delay
import java.io.BufferedWriter
import java.io.File
import java.io.IOException
import java.io.OutputStreamWriter
import org.jetbrains.anko.indeterminateProgressDialog
import java.lang.Thread.sleep

class FirstActivity : AppCompatActivity() {

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.first_layout)
//        second_edittext.setTransformationMethod(PasswordTransformationMethod.getInstance())//密码隐藏
//        second_edittext.setSelection(second_edittext.text.length)

        val button1: Button = findViewById(R.id.button1)// 登录
        button1.setOnClickListener() {
            //check the pass and the code
            var account = main_account.text.toString()
            var password = main_password.text.toString()

            var reader: SharedPreferences = getSharedPreferences("admin", MODE_PRIVATE)
            var stored_account = reader.getString("account", "")
            var stored_password = reader.getString("password", "")

            if (account != "") {
                if (password != "") {
                    if (account == stored_account) {
                        if (password == stored_password) {
                            val dialog = indeterminateProgressDialog("身份属性\n位置属性\n时间属性", "正在验证属性信息")
                            dialog.show()

                            Toast.makeText(this, "属性验证通过", Toast.LENGTH_SHORT).show()
                            val intent = Intent(this, AdminBottomBarActivity::class.java)
                            startActivity(intent)
                        } else {
                            Toast.makeText(this, "密码错误", Toast.LENGTH_SHORT).show()
                        }
                    } else {
                        Toast.makeText(this, "账号不存在", Toast.LENGTH_SHORT).show()
                    }
                } else {
                    Toast.makeText(this, "请输入密码", Toast.LENGTH_SHORT).show()
                }
            } else {
                Toast.makeText(this, "请输入账号", Toast.LENGTH_SHORT).show()
            }


//            if (user.isChecked) {
//                Toast.makeText(this, "登录成功，欢迎您！", Toast.LENGTH_SHORT).show()
//                val intent = Intent(this, UserBottomBarActivity::class.java)
//                startActivity(intent)
//            } else {
//                if (stuff.isChecked) {
//                    Toast.makeText(this, "登录成功，欢迎您！", Toast.LENGTH_SHORT).show()
////                    val intent=Intent(this, WarehouseActivity::class.java)
//                    val intent = Intent(this, AdminBottomBarActivity::class.java)
////                    val intent = Intent(this, TimePickerActivity::class.java)
//                    startActivity(intent)
//
//                } else {
//                    Toast.makeText(this, "登录失败，请选择身份！", Toast.LENGTH_SHORT).show()
//                }
//
//            }

        }

        val button2: TextView = findViewById(R.id.button2)//注册
        button2.setOnClickListener() {
            Toast.makeText(this, "开始注册", Toast.LENGTH_SHORT).show()
            val intent2 = Intent(this, SignupActivity::class.java)
            startActivity(intent2)
        }


        build_for_crypto()
    }

    fun createFolder(path: String?) {
        val file = File(path)
        if (!file.exists()) { //如果文件夹不存在
            file.mkdir() //创建文件夹
        }
    }


    val default_path_benchmarks = "/data/data/com.example.trytolearn/files/"

    fun build_for_crypto() {
        createFolder(default_path_benchmarks)
        save_file_second()
    }

    private fun save(name: String, inputText: String) {
        try {
            val output = openFileOutput(name, Context.MODE_PRIVATE)
            val writer = BufferedWriter(OutputStreamWriter(output))
            writer.use { it.write(inputText) }
        } catch (e: IOException) {
            e.printStackTrace()
        }
    }


    fun save_file_second() {
        save("ciphertext1", "gEKPFRzLVmPBz0/HKrs4J08iSNqjGT6IPc+B3D6GW6TPf+tQUMLbH8vNMDzQyjoa")
        save(
                "header_C", "-80\n" +
                "-38\n" +
                "-68\n" +
                "64\n" +
                "118\n" +
                "-118\n" +
                "122\n" +
                "72\n" +
                "26\n" +
                "52\n" +
                "-23\n" +
                "98\n" +
                "-49\n" +
                "-54\n" +
                "47\n" +
                "-113\n" +
                "-5\n" +
                "1\n" +
                "120\n" +
                "115\n" +
                "-18\n" +
                "-119\n" +
                "-74\n" +
                "4\n" +
                "-79\n" +
                "62\n" +
                "-77\n" +
                "96\n" +
                "98\n" +
                "34\n" +
                "-22\n" +
                "-59\n" +
                "53\n" +
                "119\n" +
                "121\n" +
                "121\n" +
                "-63\n" +
                "29\n" +
                "111\n" +
                "75\n" +
                "111\n" +
                "-116\n" +
                "37\n" +
                "57\n" +
                "89\n" +
                "-95\n" +
                "16\n" +
                "-96\n" +
                "4\n" +
                "38\n" +
                "31\n" +
                "-111\n" +
                "-25\n" +
                "104\n" +
                "-87\n" +
                "-37\n" +
                "85\n" +
                "45\n" +
                "108\n" +
                "-53\n" +
                "-63\n" +
                "108\n" +
                "82\n" +
                "-96\n"
        )
        save(
                "header_C1s", "4\n" +
                "22\n" +
                "95\n" +
                "-101\n" +
                "-57\n" +
                "43\n" +
                "79\n" +
                "-71\n" +
                "-14\n" +
                "51\n" +
                "106\n" +
                "23\n" +
                "41\n" +
                "99\n" +
                "102\n" +
                "36\n" +
                "33\n" +
                "-95\n" +
                "0\n" +
                "-67\n" +
                "65\n" +
                "-26\n" +
                "115\n" +
                "67\n" +
                "49\n" +
                "-75\n" +
                "-110\n" +
                "110\n" +
                "61\n" +
                "5\n" +
                "-84\n" +
                "-31\n" +
                "79\n" +
                "-70\n" +
                "-49\n" +
                "-47\n" +
                "58\n" +
                "112\n" +
                "-1\n" +
                "-46\n" +
                "9\n" +
                "-84\n" +
                "-103\n" +
                "-113\n" +
                "-104\n" +
                "84\n" +
                "-114\n" +
                "126\n" +
                "-73\n" +
                "-1\n" +
                "-110\n" +
                "61\n" +
                "-98\n" +
                "-114\n" +
                "105\n" +
                "72\n" +
                "76\n" +
                "52\n" +
                "-9\n" +
                "38\n" +
                "-23\n" +
                "12\n" +
                "54\n" +
                "85\n" +
                "next\n" +
                "15\n" +
                "46\n" +
                "-78\n" +
                "-9\n" +
                "100\n" +
                "-70\n" +
                "47\n" +
                "57\n" +
                "48\n" +
                "-75\n" +
                "-48\n" +
                "0\n" +
                "106\n" +
                "90\n" +
                "-89\n" +
                "-88\n" +
                "104\n" +
                "-83\n" +
                "-114\n" +
                "41\n" +
                "25\n" +
                "32\n" +
                "21\n" +
                "19\n" +
                "66\n" +
                "112\n" +
                "30\n" +
                "61\n" +
                "34\n" +
                "47\n" +
                "-38\n" +
                "-16\n" +
                "21\n" +
                "-61\n" +
                "31\n" +
                "93\n" +
                "21\n" +
                "1\n" +
                "2\n" +
                "-104\n" +
                "10\n" +
                "62\n" +
                "-109\n" +
                "-19\n" +
                "58\n" +
                "-50\n" +
                "-15\n" +
                "-2\n" +
                "27\n" +
                "33\n" +
                "-102\n" +
                "45\n" +
                "-78\n" +
                "-20\n" +
                "-112\n" +
                "-56\n" +
                "-54\n" +
                "44\n" +
                "91\n" +
                "0\n" +
                "-124\n" +
                "-45\n" +
                "-99\n" +
                "-86\n" +
                "next\n"
        )
        save(
                "header_C2s", "102\n" +
                "91\n" +
                "-77\n" +
                "-21\n" +
                "-78\n" +
                "-61\n" +
                "119\n" +
                "87\n" +
                "-37\n" +
                "42\n" +
                "-54\n" +
                "52\n" +
                "13\n" +
                "49\n" +
                "116\n" +
                "38\n" +
                "-86\n" +
                "-30\n" +
                "33\n" +
                "50\n" +
                "-109\n" +
                "-97\n" +
                "-27\n" +
                "-46\n" +
                "-55\n" +
                "94\n" +
                "102\n" +
                "29\n" +
                "-83\n" +
                "-75\n" +
                "-94\n" +
                "-51\n" +
                "15\n" +
                "-28\n" +
                "-81\n" +
                "-110\n" +
                "14\n" +
                "-56\n" +
                "106\n" +
                "-44\n" +
                "29\n" +
                "38\n" +
                "-79\n" +
                "88\n" +
                "-35\n" +
                "43\n" +
                "23\n" +
                "115\n" +
                "-2\n" +
                "-9\n" +
                "33\n" +
                "-14\n" +
                "67\n" +
                "-101\n" +
                "10\n" +
                "-80\n" +
                "-128\n" +
                "33\n" +
                "68\n" +
                "-96\n" +
                "60\n" +
                "46\n" +
                "-53\n" +
                "-34\n" +
                "next\n" +
                "64\n" +
                "60\n" +
                "18\n" +
                "-95\n" +
                "51\n" +
                "-8\n" +
                "85\n" +
                "-105\n" +
                "91\n" +
                "59\n" +
                "-3\n" +
                "-112\n" +
                "32\n" +
                "-124\n" +
                "-40\n" +
                "-125\n" +
                "-45\n" +
                "60\n" +
                "-91\n" +
                "122\n" +
                "43\n" +
                "5\n" +
                "-47\n" +
                "65\n" +
                "100\n" +
                "-47\n" +
                "23\n" +
                "-9\n" +
                "-22\n" +
                "-78\n" +
                "89\n" +
                "-47\n" +
                "-124\n" +
                "0\n" +
                "-61\n" +
                "-41\n" +
                "76\n" +
                "-42\n" +
                "-4\n" +
                "-6\n" +
                "116\n" +
                "105\n" +
                "88\n" +
                "-45\n" +
                "-40\n" +
                "86\n" +
                "37\n" +
                "68\n" +
                "-37\n" +
                "-16\n" +
                "0\n" +
                "30\n" +
                "-75\n" +
                "-77\n" +
                "-76\n" +
                "-111\n" +
                "-62\n" +
                "-72\n" +
                "-34\n" +
                "-126\n" +
                "-100\n" +
                "-110\n" +
                "-61\n" +
                "46\n" +
                "next\n"
        )
        save(
                "header_Crhos", "116.350\n" +
                "9.983\n"
        )
        save(
                "header_Parameters", "type a\n" +
                "q 81869981414486565817042987620009425916711137248094272342132238763687306328559\n" +
                "r 604462909877683331530751\n" +
                "h 135442522736512392410054892783912140655846630328108560\n" +
                "exp1 46\n" +
                "exp2 79\n" +
                "sign0 -1\n" +
                "sign1 1\n"
        )
        save(
                "pubkey_eggalpha", "24\n" +
                "64\n" +
                "42\n" +
                "19\n" +
                "-41\n" +
                "15\n" +
                "-29\n" +
                "-111\n" +
                "68\n" +
                "-103\n" +
                "-43\n" +
                "-80\n" +
                "52\n" +
                "-83\n" +
                "43\n" +
                "-85\n" +
                "75\n" +
                "-60\n" +
                "-35\n" +
                "49\n" +
                "-16\n" +
                "106\n" +
                "-100\n" +
                "-88\n" +
                "89\n" +
                "-58\n" +
                "42\n" +
                "-70\n" +
                "-8\n" +
                "50\n" +
                "96\n" +
                "-53\n" +
                "-119\n" +
                "-106\n" +
                "25\n" +
                "87\n" +
                "-25\n" +
                "20\n" +
                "-42\n" +
                "114\n" +
                "81\n" +
                "67\n" +
                "66\n" +
                "0\n" +
                "-126\n" +
                "-43\n" +
                "82\n" +
                "-43\n" +
                "-51\n" +
                "-22\n" +
                "102\n" +
                "-32\n" +
                "86\n" +
                "95\n" +
                "-34\n" +
                "-75\n" +
                "-74\n" +
                "-107\n" +
                "68\n" +
                "6\n" +
                "-83\n" +
                "-61\n" +
                "-10\n" +
                "115\n"
        )
        save(
                "pubkey_f", "123\n" +
                "-60\n" +
                "55\n" +
                "43\n" +
                "113\n" +
                "38\n" +
                "-117\n" +
                "-70\n" +
                "10\n" +
                "-71\n" +
                "-87\n" +
                "3\n" +
                "-120\n" +
                "121\n" +
                "81\n" +
                "-36\n" +
                "-104\n" +
                "15\n" +
                "112\n" +
                "17\n" +
                "104\n" +
                "26\n" +
                "-63\n" +
                "90\n" +
                "-8\n" +
                "-36\n" +
                "-115\n" +
                "-14\n" +
                "-66\n" +
                "73\n" +
                "-26\n" +
                "-74\n" +
                "61\n" +
                "88\n" +
                "57\n" +
                "-85\n" +
                "4\n" +
                "60\n" +
                "58\n" +
                "-39\n" +
                "127\n" +
                "-64\n" +
                "107\n" +
                "-1\n" +
                "-18\n" +
                "-8\n" +
                "37\n" +
                "22\n" +
                "-86\n" +
                "-68\n" +
                "61\n" +
                "-79\n" +
                "-71\n" +
                "40\n" +
                "-70\n" +
                "95\n" +
                "-98\n" +
                "73\n" +
                "118\n" +
                "76\n" +
                "12\n" +
                "-35\n" +
                "-122\n" +
                "-12\n"
        )
        save(
                "pubkey_g", "101\n" +
                "-13\n" +
                "-30\n" +
                "63\n" +
                "-101\n" +
                "-70\n" +
                "-6\n" +
                "67\n" +
                "40\n" +
                "-17\n" +
                "-91\n" +
                "-81\n" +
                "57\n" +
                "111\n" +
                "-119\n" +
                "59\n" +
                "-61\n" +
                "-91\n" +
                "76\n" +
                "65\n" +
                "13\n" +
                "-5\n" +
                "-93\n" +
                "-13\n" +
                "-62\n" +
                "-14\n" +
                "-103\n" +
                "-128\n" +
                "-119\n" +
                "107\n" +
                "44\n" +
                "81\n" +
                "16\n" +
                "-83\n" +
                "93\n" +
                "-72\n" +
                "-4\n" +
                "32\n" +
                "87\n" +
                "26\n" +
                "42\n" +
                "-14\n" +
                "-72\n" +
                "-42\n" +
                "-75\n" +
                "-11\n" +
                "-119\n" +
                "-122\n" +
                "80\n" +
                "-59\n" +
                "-54\n" +
                "54\n" +
                "-34\n" +
                "98\n" +
                "-116\n" +
                "-112\n" +
                "-104\n" +
                "-113\n" +
                "69\n" +
                "-35\n" +
                "86\n" +
                "-4\n" +
                "90\n" +
                "21\n"
        )
        save(
                "pubkey_h", "108\n" +
                "118\n" +
                "29\n" +
                "125\n" +
                "-63\n" +
                "-1\n" +
                "65\n" +
                "13\n" +
                "99\n" +
                "-105\n" +
                "88\n" +
                "-61\n" +
                "-127\n" +
                "-43\n" +
                "-29\n" +
                "-28\n" +
                "64\n" +
                "1\n" +
                "-97\n" +
                "75\n" +
                "19\n" +
                "39\n" +
                "-6\n" +
                "55\n" +
                "35\n" +
                "98\n" +
                "38\n" +
                "48\n" +
                "-101\n" +
                "-83\n" +
                "108\n" +
                "6\n" +
                "98\n" +
                "86\n" +
                "58\n" +
                "-75\n" +
                "53\n" +
                "-38\n" +
                "-127\n" +
                "0\n" +
                "123\n" +
                "-121\n" +
                "-124\n" +
                "112\n" +
                "-113\n" +
                "-124\n" +
                "42\n" +
                "95\n" +
                "99\n" +
                "-87\n" +
                "-66\n" +
                "-81\n" +
                "-45\n" +
                "58\n" +
                "-11\n" +
                "60\n" +
                "118\n" +
                "-31\n" +
                "-9\n" +
                "46\n" +
                "65\n" +
                "-96\n" +
                "85\n" +
                "41\n"
        )
        save(
                "pubkey_p", "type a\n" +
                "q 81869981414486565817042987620009425916711137248094272342132238763687306328559\n" +
                "r 604462909877683331530751\n" +
                "h 135442522736512392410054892783912140655846630328108560\n" +
                "exp1 46\n" +
                "exp2 79\n" +
                "sign0 -1\n" +
                "sign1 1\n"
        )
        save(
                "secretkey_attributes", "116.350\n" +
                "9.983\n"
        )
        save(
                "secretkey_D", "27\n" +
                "-114\n" +
                "-1\n" +
                "38\n" +
                "29\n" +
                "31\n" +
                "-45\n" +
                "66\n" +
                "-20\n" +
                "-73\n" +
                "-15\n" +
                "6\n" +
                "113\n" +
                "-22\n" +
                "-3\n" +
                "72\n" +
                "-82\n" +
                "-101\n" +
                "-24\n" +
                "-64\n" +
                "-73\n" +
                "-48\n" +
                "100\n" +
                "-30\n" +
                "17\n" +
                "-79\n" +
                "104\n" +
                "-41\n" +
                "-33\n" +
                "15\n" +
                "-108\n" +
                "42\n" +
                "40\n" +
                "-92\n" +
                "-91\n" +
                "-64\n" +
                "122\n" +
                "-48\n" +
                "-75\n" +
                "-48\n" +
                "94\n" +
                "101\n" +
                "-103\n" +
                "57\n" +
                "-68\n" +
                "-34\n" +
                "61\n" +
                "58\n" +
                "6\n" +
                "-68\n" +
                "-72\n" +
                "-30\n" +
                "75\n" +
                "-101\n" +
                "38\n" +
                "13\n" +
                "53\n" +
                "83\n" +
                "15\n" +
                "73\n" +
                "77\n" +
                "-36\n" +
                "-115\n" +
                "109\n"
        )
        save(
                "secretkey_D1s", "17\n" +
                "-18\n" +
                "-128\n" +
                "59\n" +
                "30\n" +
                "70\n" +
                "84\n" +
                "126\n" +
                "62\n" +
                "-19\n" +
                "94\n" +
                "9\n" +
                "62\n" +
                "100\n" +
                "127\n" +
                "-23\n" +
                "124\n" +
                "29\n" +
                "123\n" +
                "-7\n" +
                "1\n" +
                "-93\n" +
                "-48\n" +
                "-23\n" +
                "97\n" +
                "-114\n" +
                "-43\n" +
                "83\n" +
                "-75\n" +
                "-1\n" +
                "23\n" +
                "-71\n" +
                "54\n" +
                "49\n" +
                "-47\n" +
                "123\n" +
                "-30\n" +
                "105\n" +
                "-4\n" +
                "0\n" +
                "-103\n" +
                "-10\n" +
                "29\n" +
                "103\n" +
                "37\n" +
                "25\n" +
                "118\n" +
                "47\n" +
                "-83\n" +
                "-96\n" +
                "-41\n" +
                "-45\n" +
                "107\n" +
                "-18\n" +
                "-22\n" +
                "88\n" +
                "87\n" +
                "-57\n" +
                "89\n" +
                "1\n" +
                "104\n" +
                "55\n" +
                "-41\n" +
                "11\n" +
                "next\n" +
                "23\n" +
                "13\n" +
                "32\n" +
                "14\n" +
                "11\n" +
                "94\n" +
                "-117\n" +
                "-25\n" +
                "122\n" +
                "121\n" +
                "-29\n" +
                "-38\n" +
                "83\n" +
                "-76\n" +
                "2\n" +
                "108\n" +
                "-61\n" +
                "-78\n" +
                "77\n" +
                "5\n" +
                "-117\n" +
                "-123\n" +
                "1\n" +
                "70\n" +
                "-43\n" +
                "-5\n" +
                "78\n" +
                "93\n" +
                "119\n" +
                "85\n" +
                "-37\n" +
                "4\n" +
                "41\n" +
                "-93\n" +
                "88\n" +
                "-105\n" +
                "92\n" +
                "-127\n" +
                "56\n" +
                "-54\n" +
                "-51\n" +
                "-7\n" +
                "-105\n" +
                "-52\n" +
                "-36\n" +
                "-57\n" +
                "-16\n" +
                "81\n" +
                "-66\n" +
                "-21\n" +
                "-76\n" +
                "118\n" +
                "66\n" +
                "-59\n" +
                "5\n" +
                "26\n" +
                "101\n" +
                "-55\n" +
                "-35\n" +
                "-48\n" +
                "-90\n" +
                "-67\n" +
                "-52\n" +
                "-38\n" +
                "next\n"
        )
        save(
                "secretkey_D2s", "-106\n" +
                "-97\n" +
                "86\n" +
                "34\n" +
                "13\n" +
                "23\n" +
                "61\n" +
                "-125\n" +
                "92\n" +
                "39\n" +
                "30\n" +
                "-86\n" +
                "-46\n" +
                "-88\n" +
                "11\n" +
                "30\n" +
                "2\n" +
                "71\n" +
                "-69\n" +
                "-22\n" +
                "-61\n" +
                "-35\n" +
                "39\n" +
                "1\n" +
                "124\n" +
                "-111\n" +
                "53\n" +
                "76\n" +
                "-112\n" +
                "88\n" +
                "-120\n" +
                "47\n" +
                "72\n" +
                "-34\n" +
                "121\n" +
                "13\n" +
                "-88\n" +
                "-38\n" +
                "-72\n" +
                "45\n" +
                "122\n" +
                "15\n" +
                "-60\n" +
                "37\n" +
                "-46\n" +
                "111\n" +
                "-54\n" +
                "68\n" +
                "13\n" +
                "-87\n" +
                "-54\n" +
                "82\n" +
                "83\n" +
                "53\n" +
                "104\n" +
                "94\n" +
                "-51\n" +
                "70\n" +
                "-4\n" +
                "-28\n" +
                "79\n" +
                "-30\n" +
                "-87\n" +
                "-92\n" +
                "next\n" +
                "5\n" +
                "-69\n" +
                "17\n" +
                "48\n" +
                "80\n" +
                "-125\n" +
                "59\n" +
                "16\n" +
                "117\n" +
                "103\n" +
                "5\n" +
                "-96\n" +
                "-30\n" +
                "79\n" +
                "-90\n" +
                "-25\n" +
                "-43\n" +
                "-8\n" +
                "7\n" +
                "-104\n" +
                "66\n" +
                "-52\n" +
                "16\n" +
                "22\n" +
                "108\n" +
                "-79\n" +
                "121\n" +
                "33\n" +
                "87\n" +
                "-113\n" +
                "-10\n" +
                "84\n" +
                "-124\n" +
                "-107\n" +
                "-104\n" +
                "96\n" +
                "2\n" +
                "-14\n" +
                "14\n" +
                "114\n" +
                "-19\n" +
                "-91\n" +
                "9\n" +
                "-64\n" +
                "44\n" +
                "18\n" +
                "63\n" +
                "-37\n" +
                "-10\n" +
                "52\n" +
                "-45\n" +
                "2\n" +
                "-76\n" +
                "69\n" +
                "-114\n" +
                "8\n" +
                "-106\n" +
                "-101\n" +
                "30\n" +
                "72\n" +
                "-98\n" +
                "45\n" +
                "-3\n" +
                "124\n" +
                "next\n"
        )
        save(
                "secretkey_Parameters", "type a\n" +
                "q 81869981414486565817042987620009425916711137248094272342132238763687306328559\n" +
                "r 604462909877683331530751\n" +
                "h 135442522736512392410054892783912140655846630328108560\n" +
                "exp1 46\n" +
                "exp2 79\n" +
                "sign0 -1\n" +
                "sign1 1\n"
        )
    }

    fun save_file() {
        save("orderid", "");
        save("ciphertext1", "XsN/Tk1K9C/oxeEKnxWUaA==")
        save(
                "header_C", "125\n" +
                "-116\n" +
                "-47\n" +
                "89\n" +
                "-57\n" +
                "46\n" +
                "76\n" +
                "112\n" +
                "92\n" +
                "-13\n" +
                "-121\n" +
                "101\n" +
                "-48\n" +
                "-83\n" +
                "-1\n" +
                "107\n" +
                "57\n" +
                "-53\n" +
                "-100\n" +
                "77\n" +
                "-100\n" +
                "-56\n" +
                "-31\n" +
                "73\n" +
                "85\n" +
                "-29\n" +
                "80\n" +
                "56\n" +
                "60\n" +
                "-46\n" +
                "85\n" +
                "81\n" +
                "51\n" +
                "40\n" +
                "-103\n" +
                "47\n" +
                "29\n" +
                "26\n" +
                "-28\n" +
                "20\n" +
                "20\n" +
                "33\n" +
                "-119\n" +
                "92\n" +
                "4\n" +
                "44\n" +
                "97\n" +
                "41\n" +
                "-99\n" +
                "-113\n" +
                "-40\n" +
                "-5\n" +
                "-21\n" +
                "116\n" +
                "-29\n" +
                "48\n" +
                "62\n" +
                "91\n" +
                "-36\n" +
                "82\n" +
                "-92\n" +
                "-124\n" +
                "116\n" +
                "-16\n"
        )
        save(
                "header_C1s", "102\n" +
                "-111\n" +
                "14\n" +
                "-107\n" +
                "17\n" +
                "-41\n" +
                "6\n" +
                "-18\n" +
                "-89\n" +
                "26\n" +
                "24\n" +
                "-37\n" +
                "20\n" +
                "76\n" +
                "-125\n" +
                "-115\n" +
                "52\n" +
                "126\n" +
                "-127\n" +
                "-15\n" +
                "57\n" +
                "-89\n" +
                "-118\n" +
                "99\n" +
                "-1\n" +
                "15\n" +
                "51\n" +
                "-37\n" +
                "109\n" +
                "-19\n" +
                "36\n" +
                "107\n" +
                "113\n" +
                "28\n" +
                "45\n" +
                "52\n" +
                "-85\n" +
                "50\n" +
                "-71\n" +
                "92\n" +
                "73\n" +
                "-73\n" +
                "6\n" +
                "-24\n" +
                "-79\n" +
                "115\n" +
                "-44\n" +
                "75\n" +
                "21\n" +
                "36\n" +
                "-5\n" +
                "-8\n" +
                "100\n" +
                "-43\n" +
                "30\n" +
                "21\n" +
                "-99\n" +
                "-7\n" +
                "127\n" +
                "-5\n" +
                "48\n" +
                "103\n" +
                "-71\n" +
                "-35\n" +
                "next\n" +
                "113\n" +
                "73\n" +
                "103\n" +
                "-26\n" +
                "-99\n" +
                "61\n" +
                "-45\n" +
                "12\n" +
                "-27\n" +
                "51\n" +
                "-79\n" +
                "23\n" +
                "-21\n" +
                "-107\n" +
                "-101\n" +
                "-40\n" +
                "-72\n" +
                "-94\n" +
                "82\n" +
                "74\n" +
                "7\n" +
                "109\n" +
                "18\n" +
                "-100\n" +
                "24\n" +
                "-37\n" +
                "12\n" +
                "-77\n" +
                "-95\n" +
                "-5\n" +
                "93\n" +
                "-81\n" +
                "19\n" +
                "-13\n" +
                "83\n" +
                "-62\n" +
                "79\n" +
                "-38\n" +
                "23\n" +
                "-24\n" +
                "2\n" +
                "43\n" +
                "126\n" +
                "75\n" +
                "78\n" +
                "-75\n" +
                "80\n" +
                "-60\n" +
                "-128\n" +
                "94\n" +
                "103\n" +
                "29\n" +
                "38\n" +
                "-4\n" +
                "91\n" +
                "-31\n" +
                "99\n" +
                "56\n" +
                "110\n" +
                "85\n" +
                "-47\n" +
                "-120\n" +
                "27\n" +
                "-14\n" +
                "next\n" +
                "-108\n" +
                "22\n" +
                "-89\n" +
                "-45\n" +
                "101\n" +
                "36\n" +
                "-98\n" +
                "-57\n" +
                "44\n" +
                "-7\n" +
                "-17\n" +
                "-46\n" +
                "-47\n" +
                "-118\n" +
                "40\n" +
                "-109\n" +
                "-71\n" +
                "-75\n" +
                "68\n" +
                "-54\n" +
                "-121\n" +
                "118\n" +
                "10\n" +
                "65\n" +
                "27\n" +
                "93\n" +
                "4\n" +
                "47\n" +
                "32\n" +
                "33\n" +
                "51\n" +
                "-55\n" +
                "-107\n" +
                "-12\n" +
                "-119\n" +
                "-55\n" +
                "-81\n" +
                "-22\n" +
                "42\n" +
                "45\n" +
                "113\n" +
                "63\n" +
                "11\n" +
                "115\n" +
                "-109\n" +
                "12\n" +
                "57\n" +
                "45\n" +
                "119\n" +
                "41\n" +
                "-11\n" +
                "5\n" +
                "108\n" +
                "-18\n" +
                "45\n" +
                "11\n" +
                "-73\n" +
                "47\n" +
                "119\n" +
                "109\n" +
                "-40\n" +
                "5\n" +
                "-78\n" +
                "-64\n" +
                "next\n"
        )
        save(
                "header_C2s", "53\n" +
                "-60\n" +
                "16\n" +
                "-92\n" +
                "-61\n" +
                "94\n" +
                "4\n" +
                "-124\n" +
                "-90\n" +
                "-120\n" +
                "-54\n" +
                "-65\n" +
                "83\n" +
                "-44\n" +
                "-67\n" +
                "-14\n" +
                "106\n" +
                "61\n" +
                "-44\n" +
                "-51\n" +
                "84\n" +
                "-115\n" +
                "113\n" +
                "-93\n" +
                "65\n" +
                "-24\n" +
                "119\n" +
                "-28\n" +
                "-21\n" +
                "-56\n" +
                "-36\n" +
                "-32\n" +
                "-98\n" +
                "-26\n" +
                "-19\n" +
                "-108\n" +
                "61\n" +
                "22\n" +
                "57\n" +
                "75\n" +
                "68\n" +
                "-118\n" +
                "18\n" +
                "1\n" +
                "7\n" +
                "-44\n" +
                "-11\n" +
                "-109\n" +
                "-124\n" +
                "-72\n" +
                "-69\n" +
                "47\n" +
                "47\n" +
                "20\n" +
                "99\n" +
                "-94\n" +
                "-64\n" +
                "-82\n" +
                "-105\n" +
                "-124\n" +
                "-107\n" +
                "10\n" +
                "-109\n" +
                "-57\n" +
                "next\n" +
                "-104\n" +
                "-70\n" +
                "14\n" +
                "-69\n" +
                "0\n" +
                "-89\n" +
                "22\n" +
                "47\n" +
                "-89\n" +
                "86\n" +
                "76\n" +
                "-93\n" +
                "88\n" +
                "-32\n" +
                "-81\n" +
                "80\n" +
                "-82\n" +
                "-74\n" +
                "23\n" +
                "-13\n" +
                "96\n" +
                "-30\n" +
                "100\n" +
                "-29\n" +
                "-33\n" +
                "-24\n" +
                "6\n" +
                "-112\n" +
                "-23\n" +
                "-103\n" +
                "-54\n" +
                "-104\n" +
                "18\n" +
                "12\n" +
                "-121\n" +
                "61\n" +
                "-106\n" +
                "51\n" +
                "36\n" +
                "-7\n" +
                "10\n" +
                "-18\n" +
                "-37\n" +
                "22\n" +
                "-37\n" +
                "32\n" +
                "17\n" +
                "81\n" +
                "40\n" +
                "-121\n" +
                "-35\n" +
                "-96\n" +
                "-127\n" +
                "83\n" +
                "-124\n" +
                "73\n" +
                "-106\n" +
                "-26\n" +
                "-106\n" +
                "64\n" +
                "-26\n" +
                "-16\n" +
                "90\n" +
                "59\n" +
                "next\n" +
                "-98\n" +
                "119\n" +
                "-96\n" +
                "-20\n" +
                "5\n" +
                "-102\n" +
                "-65\n" +
                "122\n" +
                "45\n" +
                "105\n" +
                "-85\n" +
                "-98\n" +
                "80\n" +
                "-8\n" +
                "-8\n" +
                "53\n" +
                "-88\n" +
                "98\n" +
                "-113\n" +
                "-120\n" +
                "85\n" +
                "87\n" +
                "-6\n" +
                "-70\n" +
                "-44\n" +
                "-100\n" +
                "43\n" +
                "-56\n" +
                "40\n" +
                "123\n" +
                "-66\n" +
                "62\n" +
                "75\n" +
                "60\n" +
                "-61\n" +
                "-26\n" +
                "35\n" +
                "-102\n" +
                "49\n" +
                "-18\n" +
                "47\n" +
                "-47\n" +
                "-65\n" +
                "61\n" +
                "-28\n" +
                "-25\n" +
                "-30\n" +
                "62\n" +
                "100\n" +
                "-119\n" +
                "-3\n" +
                "-79\n" +
                "-42\n" +
                "-51\n" +
                "-104\n" +
                "92\n" +
                "83\n" +
                "104\n" +
                "50\n" +
                "15\n" +
                "-65\n" +
                "56\n" +
                "-41\n" +
                "-104\n" +
                "next\n"
        )
        save(
                "header_Crhos", "BUAA\n" +
                "Beijing\n" +
                "HD\n"
        )
        save(
                "header_Parameters", "type a\n" +
                "q 81869981414486565817042987620009425916711137248094272342132238763687306328559\n" +
                "r 604462909877683331530751\n" +
                "h 135442522736512392410054892783912140655846630328108560\n" +
                "exp1 46\n" +
                "exp2 79\n" +
                "sign0 -1\n" +
                "sign1 1\n"
        )
        save(
                "pubkey_eggalpha", "-85\n" +
                "23\n" +
                "-106\n" +
                "47\n" +
                "-41\n" +
                "-21\n" +
                "-64\n" +
                "-125\n" +
                "2\n" +
                "-48\n" +
                "87\n" +
                "41\n" +
                "-27\n" +
                "90\n" +
                "-11\n" +
                "-7\n" +
                "-42\n" +
                "-118\n" +
                "45\n" +
                "87\n" +
                "-109\n" +
                "102\n" +
                "27\n" +
                "-92\n" +
                "54\n" +
                "44\n" +
                "12\n" +
                "-79\n" +
                "-127\n" +
                "31\n" +
                "12\n" +
                "79\n" +
                "113\n" +
                "79\n" +
                "21\n" +
                "-85\n" +
                "-77\n" +
                "31\n" +
                "78\n" +
                "-14\n" +
                "-95\n" +
                "10\n" +
                "-100\n" +
                "-113\n" +
                "-99\n" +
                "-122\n" +
                "-36\n" +
                "-46\n" +
                "97\n" +
                "9\n" +
                "8\n" +
                "-86\n" +
                "-28\n" +
                "74\n" +
                "75\n" +
                "-122\n" +
                "-82\n" +
                "86\n" +
                "73\n" +
                "-109\n" +
                "47\n" +
                "5\n" +
                "69\n" +
                "-67\n"
        )
        save(
                "pubkey_f", "-122\n" +
                "-105\n" +
                "53\n" +
                "-53\n" +
                "-21\n" +
                "-45\n" +
                "-1\n" +
                "-93\n" +
                "64\n" +
                "19\n" +
                "-30\n" +
                "-87\n" +
                "4\n" +
                "109\n" +
                "-118\n" +
                "56\n" +
                "-67\n" +
                "88\n" +
                "-107\n" +
                "-56\n" +
                "-71\n" +
                "57\n" +
                "82\n" +
                "101\n" +
                "27\n" +
                "121\n" +
                "19\n" +
                "39\n" +
                "-41\n" +
                "-25\n" +
                "-93\n" +
                "-13\n" +
                "14\n" +
                "59\n" +
                "47\n" +
                "-68\n" +
                "116\n" +
                "-48\n" +
                "-115\n" +
                "34\n" +
                "3\n" +
                "-33\n" +
                "37\n" +
                "-96\n" +
                "-94\n" +
                "79\n" +
                "-12\n" +
                "-72\n" +
                "113\n" +
                "7\n" +
                "123\n" +
                "1\n" +
                "-29\n" +
                "-128\n" +
                "78\n" +
                "-4\n" +
                "60\n" +
                "65\n" +
                "48\n" +
                "-32\n" +
                "-5\n" +
                "-22\n" +
                "-62\n" +
                "-101\n"
        )
        save(
                "pubkey_g", "-92\n" +
                "-103\n" +
                "-101\n" +
                "-103\n" +
                "-118\n" +
                "-11\n" +
                "-10\n" +
                "-99\n" +
                "17\n" +
                "-120\n" +
                "-105\n" +
                "-69\n" +
                "24\n" +
                "-70\n" +
                "29\n" +
                "-120\n" +
                "-67\n" +
                "37\n" +
                "113\n" +
                "-88\n" +
                "95\n" +
                "23\n" +
                "-49\n" +
                "-30\n" +
                "24\n" +
                "57\n" +
                "1\n" +
                "-65\n" +
                "26\n" +
                "26\n" +
                "69\n" +
                "84\n" +
                "123\n" +
                "32\n" +
                "-38\n" +
                "-36\n" +
                "-124\n" +
                "-15\n" +
                "85\n" +
                "-79\n" +
                "-5\n" +
                "95\n" +
                "56\n" +
                "27\n" +
                "-19\n" +
                "-109\n" +
                "11\n" +
                "-121\n" +
                "-94\n" +
                "-128\n" +
                "86\n" +
                "-32\n" +
                "-75\n" +
                "98\n" +
                "1\n" +
                "-65\n" +
                "98\n" +
                "-102\n" +
                "97\n" +
                "56\n" +
                "-39\n" +
                "-51\n" +
                "-123\n" +
                "5\n"
        )
        save(
                "pubkey_h", "63\n" +
                "74\n" +
                "-119\n" +
                "-59\n" +
                "81\n" +
                "1\n" +
                "18\n" +
                "124\n" +
                "-127\n" +
                "71\n" +
                "-74\n" +
                "84\n" +
                "8\n" +
                "107\n" +
                "62\n" +
                "28\n" +
                "79\n" +
                "-106\n" +
                "76\n" +
                "-11\n" +
                "63\n" +
                "-4\n" +
                "-3\n" +
                "-18\n" +
                "41\n" +
                "-32\n" +
                "113\n" +
                "92\n" +
                "70\n" +
                "110\n" +
                "-27\n" +
                "77\n" +
                "-128\n" +
                "60\n" +
                "-1\n" +
                "-70\n" +
                "57\n" +
                "122\n" +
                "102\n" +
                "-95\n" +
                "-68\n" +
                "119\n" +
                "4\n" +
                "-53\n" +
                "-97\n" +
                "-88\n" +
                "106\n" +
                "-3\n" +
                "46\n" +
                "-91\n" +
                "-44\n" +
                "-126\n" +
                "81\n" +
                "-46\n" +
                "42\n" +
                "-97\n" +
                "-100\n" +
                "-81\n" +
                "-57\n" +
                "-126\n" +
                "-43\n" +
                "-14\n" +
                "120\n" +
                "41\n"
        )
        save(
                "pubkey_p", "type a\n" +
                "q 81869981414486565817042987620009425916711137248094272342132238763687306328559\n" +
                "r 604462909877683331530751\n" +
                "h 135442522736512392410054892783912140655846630328108560\n" +
                "exp1 46\n" +
                "exp2 79\n" +
                "sign0 -1\n" +
                "sign1 1\n"
        )
        save(
                "secretkey_attributes", "Beijing\n" +
                "HD\n" +
                "BUAA\n"
        )
        save(
                "secretkey_D", "10\n" +
                "38\n" +
                "-22\n" +
                "-35\n" +
                "-90\n" +
                "-54\n" +
                "7\n" +
                "20\n" +
                "68\n" +
                "-125\n" +
                "-3\n" +
                "106\n" +
                "-9\n" +
                "-35\n" +
                "-81\n" +
                "99\n" +
                "-42\n" +
                "122\n" +
                "-25\n" +
                "-108\n" +
                "-70\n" +
                "90\n" +
                "45\n" +
                "-13\n" +
                "-69\n" +
                "95\n" +
                "-57\n" +
                "31\n" +
                "42\n" +
                "87\n" +
                "125\n" +
                "-121\n" +
                "48\n" +
                "-118\n" +
                "-101\n" +
                "117\n" +
                "58\n" +
                "93\n" +
                "-29\n" +
                "66\n" +
                "-37\n" +
                "-66\n" +
                "100\n" +
                "32\n" +
                "-40\n" +
                "90\n" +
                "103\n" +
                "-52\n" +
                "-103\n" +
                "-69\n" +
                "100\n" +
                "-26\n" +
                "-99\n" +
                "-55\n" +
                "-30\n" +
                "79\n" +
                "0\n" +
                "-45\n" +
                "-89\n" +
                "-2\n" +
                "-26\n" +
                "104\n" +
                "31\n" +
                "82\n"
        )
        save(
                "secretkey_D1s", "42\n" +
                "93\n" +
                "-109\n" +
                "-29\n" +
                "127\n" +
                "43\n" +
                "-68\n" +
                "-80\n" +
                "62\n" +
                "97\n" +
                "-13\n" +
                "-23\n" +
                "-96\n" +
                "67\n" +
                "20\n" +
                "63\n" +
                "103\n" +
                "110\n" +
                "-58\n" +
                "-65\n" +
                "105\n" +
                "-37\n" +
                "-58\n" +
                "11\n" +
                "16\n" +
                "-60\n" +
                "118\n" +
                "114\n" +
                "-109\n" +
                "8\n" +
                "-121\n" +
                "33\n" +
                "1\n" +
                "20\n" +
                "110\n" +
                "-108\n" +
                "-30\n" +
                "-112\n" +
                "25\n" +
                "64\n" +
                "-77\n" +
                "32\n" +
                "-52\n" +
                "-6\n" +
                "20\n" +
                "-6\n" +
                "-73\n" +
                "-104\n" +
                "122\n" +
                "73\n" +
                "1\n" +
                "-83\n" +
                "101\n" +
                "-64\n" +
                "1\n" +
                "76\n" +
                "44\n" +
                "-46\n" +
                "39\n" +
                "12\n" +
                "101\n" +
                "-25\n" +
                "71\n" +
                "-3\n" +
                "next\n" +
                "105\n" +
                "-124\n" +
                "-60\n" +
                "-71\n" +
                "8\n" +
                "60\n" +
                "-92\n" +
                "29\n" +
                "-51\n" +
                "-52\n" +
                "62\n" +
                "120\n" +
                "116\n" +
                "63\n" +
                "-41\n" +
                "-3\n" +
                "-74\n" +
                "-52\n" +
                "104\n" +
                "-12\n" +
                "12\n" +
                "-27\n" +
                "-29\n" +
                "98\n" +
                "25\n" +
                "-104\n" +
                "106\n" +
                "-120\n" +
                "3\n" +
                "64\n" +
                "-16\n" +
                "-2\n" +
                "-113\n" +
                "24\n" +
                "59\n" +
                "-117\n" +
                "115\n" +
                "-28\n" +
                "-45\n" +
                "-113\n" +
                "109\n" +
                "27\n" +
                "30\n" +
                "-79\n" +
                "90\n" +
                "59\n" +
                "-67\n" +
                "-21\n" +
                "-118\n" +
                "-64\n" +
                "106\n" +
                "-82\n" +
                "126\n" +
                "107\n" +
                "90\n" +
                "-72\n" +
                "-82\n" +
                "-30\n" +
                "-28\n" +
                "-82\n" +
                "-104\n" +
                "-73\n" +
                "-7\n" +
                "63\n" +
                "next\n" +
                "59\n" +
                "-97\n" +
                "110\n" +
                "-93\n" +
                "78\n" +
                "-19\n" +
                "80\n" +
                "-97\n" +
                "68\n" +
                "43\n" +
                "40\n" +
                "51\n" +
                "64\n" +
                "-23\n" +
                "-121\n" +
                "92\n" +
                "-10\n" +
                "-10\n" +
                "-57\n" +
                "31\n" +
                "55\n" +
                "66\n" +
                "19\n" +
                "7\n" +
                "73\n" +
                "-5\n" +
                "50\n" +
                "32\n" +
                "30\n" +
                "83\n" +
                "-47\n" +
                "127\n" +
                "47\n" +
                "64\n" +
                "53\n" +
                "-11\n" +
                "-27\n" +
                "-85\n" +
                "-102\n" +
                "24\n" +
                "12\n" +
                "44\n" +
                "-114\n" +
                "-37\n" +
                "25\n" +
                "69\n" +
                "-57\n" +
                "114\n" +
                "-76\n" +
                "97\n" +
                "-59\n" +
                "42\n" +
                "-21\n" +
                "-12\n" +
                "-85\n" +
                "-82\n" +
                "-9\n" +
                "-86\n" +
                "32\n" +
                "105\n" +
                "-66\n" +
                "-30\n" +
                "-101\n" +
                "-101\n" +
                "next\n"
        )
        save(
                "secretkey_D2s", "67\n" +
                "62\n" +
                "-40\n" +
                "37\n" +
                "72\n" +
                "-97\n" +
                "-78\n" +
                "82\n" +
                "-27\n" +
                "28\n" +
                "-44\n" +
                "124\n" +
                "96\n" +
                "116\n" +
                "126\n" +
                "-68\n" +
                "42\n" +
                "11\n" +
                "127\n" +
                "42\n" +
                "16\n" +
                "-15\n" +
                "-75\n" +
                "-42\n" +
                "79\n" +
                "85\n" +
                "30\n" +
                "-2\n" +
                "-78\n" +
                "16\n" +
                "-78\n" +
                "-58\n" +
                "-88\n" +
                "-74\n" +
                "-102\n" +
                "-17\n" +
                "78\n" +
                "25\n" +
                "-32\n" +
                "-121\n" +
                "-94\n" +
                "118\n" +
                "84\n" +
                "33\n" +
                "-53\n" +
                "33\n" +
                "-72\n" +
                "109\n" +
                "37\n" +
                "67\n" +
                "-113\n" +
                "-62\n" +
                "-4\n" +
                "96\n" +
                "-115\n" +
                "77\n" +
                "-73\n" +
                "-53\n" +
                "-96\n" +
                "1\n" +
                "-57\n" +
                "51\n" +
                "-115\n" +
                "-73\n" +
                "next\n" +
                "77\n" +
                "-103\n" +
                "-17\n" +
                "-19\n" +
                "16\n" +
                "2\n" +
                "-100\n" +
                "90\n" +
                "29\n" +
                "53\n" +
                "-119\n" +
                "-14\n" +
                "91\n" +
                "-124\n" +
                "-50\n" +
                "38\n" +
                "18\n" +
                "-101\n" +
                "7\n" +
                "-2\n" +
                "62\n" +
                "-87\n" +
                "-116\n" +
                "5\n" +
                "71\n" +
                "-5\n" +
                "78\n" +
                "-59\n" +
                "-90\n" +
                "-106\n" +
                "-97\n" +
                "-119\n" +
                "107\n" +
                "-31\n" +
                "32\n" +
                "13\n" +
                "-51\n" +
                "-40\n" +
                "-48\n" +
                "-115\n" +
                "-41\n" +
                "71\n" +
                "114\n" +
                "-122\n" +
                "3\n" +
                "76\n" +
                "12\n" +
                "2\n" +
                "56\n" +
                "76\n" +
                "-43\n" +
                "-106\n" +
                "102\n" +
                "110\n" +
                "46\n" +
                "92\n" +
                "60\n" +
                "39\n" +
                "-69\n" +
                "-6\n" +
                "-110\n" +
                "-88\n" +
                "50\n" +
                "90\n" +
                "next\n" +
                "58\n" +
                "120\n" +
                "-12\n" +
                "-28\n" +
                "105\n" +
                "-117\n" +
                "-116\n" +
                "73\n" +
                "14\n" +
                "97\n" +
                "-19\n" +
                "-34\n" +
                "60\n" +
                "-107\n" +
                "44\n" +
                "52\n" +
                "-15\n" +
                "87\n" +
                "-64\n" +
                "-33\n" +
                "-96\n" +
                "63\n" +
                "106\n" +
                "28\n" +
                "123\n" +
                "-9\n" +
                "-18\n" +
                "91\n" +
                "63\n" +
                "-118\n" +
                "28\n" +
                "-44\n" +
                "116\n" +
                "55\n" +
                "-128\n" +
                "-124\n" +
                "13\n" +
                "80\n" +
                "92\n" +
                "22\n" +
                "-3\n" +
                "37\n" +
                "-34\n" +
                "-63\n" +
                "-53\n" +
                "74\n" +
                "-69\n" +
                "-54\n" +
                "-3\n" +
                "37\n" +
                "-11\n" +
                "55\n" +
                "-115\n" +
                "-31\n" +
                "-3\n" +
                "52\n" +
                "-59\n" +
                "78\n" +
                "66\n" +
                "-23\n" +
                "50\n" +
                "-87\n" +
                "-8\n" +
                "59\n" +
                "next\n"
        )
        save(
                "secretkey_Parameters", "type a\n" +
                "q 81869981414486565817042987620009425916711137248094272342132238763687306328559\n" +
                "r 604462909877683331530751\n" +
                "h 135442522736512392410054892783912140655846630328108560\n" +
                "exp1 46\n" +
                "exp2 79\n" +
                "sign0 -1\n" +
                "sign1 1\n"
        )
    }


}